analytic-signal.preview-pdf
anthropic.claude-code
bierner.markdown-mermaid
blueglassblock.better-json5
bodil.prettier-toml
bradlc.vscode-tailwindcss
charliermarsh.ruff
coenraads.disableligatures
dart-code.dart-code
dart-code.flutter
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
donjayamanne.githistory
drblury.protobuf-vsc
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
foxundermoon.shell-format
github.copilot-chat
golang.go
graphql.vscode-graphql-syntax
gruntfuggly.todo-tree
hashicorp.terraform
james-yu.latex-workshop
kamikillerto.vscode-colorize
mads-hartmann.bash-ide-vscode
mikestead.dotenv
ms-azuretools.vscode-containers
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cpptools
ms-vscode.remote-explorer
pkief.material-icon-theme
redhat.java
shd101wyy.markdown-preview-enhanced
stkb.rewrap
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
timonwong.shellcheck
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
